# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BindingMap..::..Contains Method
BindingMap Class See Also
---
The Contains method is used to check if the parameter binding exists for one definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override bool Contains(
	Definition key
)
```

Visual Basic
---
```text
Public Overrides Function Contains ( _
	key As Definition _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	Definition^ key
) override
```

# ### Parameters
key
    Type: Autodesk.Revit.DB..::..Definition A parameter definition which can be an existing definition or one from a shared parameters file.
# See Also
BindingMap Class
Autodesk.Revit.DB Namespace